database/factories/CommentFactory.php

    public function definition()
    {
        return [
            'content' => $this->faker->paragraphs(rand(1, 4), true),

            'author_id' => User::query()
                ->inRandomOrder()
                ->limit(1)
                ->first()
---
select * from `users` order by RAND() limit 1